{"pages":[{"title":"About","text":"About meHello, a warm welcome to my blog! My name is Yuxiang Zhang. I am currently a PhD student at University College Dublin. My research interests lie in the area of CFD (Computational fluid dynamics/Colorful Figures Delivery) and bridge engineering. I am currently wiring my thesis, of which the title is still a mystery. If everything converges like a simple steady-state simulation, I will be expecting my PhD degree in May 2022. Fingers-crossed! Education2018- PresentPhD in Civil EngineeringThesis working title: Application of Computational Fluid Dynamics in Bridge EngineeringFunding: China Scholarship CouncilUniversity College Dublin In CFD simulations, my research has investigated the application of CFD modelling for the analysis of wind on the Rose Fitzgerald Kennedy Bridge. The outcome of my research will help validate the use of CFD for the analysis of wind for bridge design. Research included: • Securing access to the Key cluster computer operated by ICHEC (Irish Centre for High-End Computing) • Project management and self-directed learning • Collaboration with stakeholders: Arup CFD team, TII, NSAI • Publication of Journal Papers • Presentations at international conferences 2017-2018Masters of Engineering Science in Structural EngineeringGrade: 2:1University College DublinResearch thesis: CFD simulations examining sheltering traffic from wind. 2013-2017Bachelor of Engineering in Civil Engineering1st Class honoursChang’an University, China Work experienceWould you be suprised if I told you I used to work in a butcher’s store in Dublin? PublicationA literature reviewZhang, Y., Cardiff, P., and Keenahan, J., (2021). ‘Wind-induced phenomena in long-span cable-supported bridges: a comparative review of wind tunnel tests and computational fluid dynamics modelling’, Applied Sciences, 11(4), 1642. link of the paper Honestly, I still cannot understand why I would even try to write such a paper. But anyway, with the help of my advisors, I managed to publish this as the first journal paper during my PhD. Well, you got to start somewhere. If you really spend time reading this paper, you probably will not learn much but some basics about wind problems on bridges and CFD application in bridge engineering. After so long, I think the content can be summarised into three sentences: CFD is cool but complex; Wind tunnel is the common practice but obviously not perfect for bridge aerodyanmic study; There is SO MUCH ROOM for improvement in using CFD in bridge engineering. A comparison between CFD and wind tunnel tests (WTTs)Zhang, Y., Cardiff, P., Cahill, F., and Keenahan, J., (2021). ‘Assessing the capability of computational fluid dynamics models in replicating wind tunnel test results for the Rose Fitzgerald Kennedy Bridge’, CivilEng 2, no. 4: 1065-1090. link of the paper. So after I finished the literature review (well this might not be true, I probably planned everything long ago), I was thinking maybe I should compare CFD and WTTs since I have written so much against WTTs in bridge engineering. And BINGO! My supervisor got me a WTT report from a famous construction company that I don’t think I should mention here though you will probably find out which one it is if you read the paper (OMG, such a long sentence for me). Anyway, I replicated the WTTs mentioned in the report and did a comparison on the results. It turned out to be okay but not quite satisfying because some non-negligible discrepancies were found within the comparison between WTTs and CFD and we cannot say which one got the better results. A methodology paperZhang, Y., MacReamoinn, R., Cardiff, P., and Keenahan, J., (2021). ‘A workflow for analysing wind effects on long-span bridges using open-source software’, under review with the OpenFOAM Journal. This paper talks about the methodology that can be adopted by bridge engineers when performing CFD simulations. It is still under review. I am not optimistic about it. I don’t think anyone will like it. I can only imagine that the reviewers be like: Emmm, this is a new piece of SH$$ yet it is still a piece of SH$$. A comparison between CFD and field measurementZhang, Y., Cardiff, P., Sweeney, C., and Keenahan, J., (2021). ‘Comparison of field data from the Rose Fitzgerald Bridge with full-scale CFD models’, under review with the Journal of Bridge Engineering. Did I spend months standing on a bridge? Nope. I amd privileged to be granted the access to some fancy real-time data recorded by four anemometers on the bridge. Why would I need to do this? Because I still want to be the bad guy to tell everyone else that CFD is better than your over-priced WTTs. I need a third-party to help me prove that. And this third-party will be this non-biased field measurement data. A conference paperZhang, Y., Cardiff, P., and Keenahan, J., (2020). ‘A numerical study of the effect of wind barriers on traffic and the bridge deck’, in Proceedings of the Civil Engineering Research in Ireland Conference, Cork, Ireland, 27-28 August 2020. link of the paper Yes, I know. It is funny to mention a conference paper. But the content of this paper is basically what I did in my Masters.My advice: Don’t do a masters but find a PhD position or a decent job. Scholarships and AwardsChina Scholarship Council (CSC) Individual Fellowship Award (2018)This scholarship sponsors Chinese citizens to pursue study abroad and for international students to study in China. Awardees are selected through a rigorous academic evaluation process organised by the Chinese Scholarship Council. This individual fellowship, awarded to me, funds my PhD studies at UCD. Nvidia GPU Grant (2019)This grant provided by NVidia offers a GTX Titan V GPU to support my PhD studies. The GPU is used for post-processing, rendering and computational modelling. HobbiesPhotographyViolin About this siteThis site is my personal blog. I will write something on OpenFOAM, Paraview, Linux, Photography, and some crazy random stuffs.Currently, this site is still under construction, and so you will find a lot of messy widgets and uncomfortable fonts. I will gradually fix them. Again, thank you for visiting this site. I wish you a fast convergence!","link":"/about/index.html"}],"posts":[{"title":"How to Compile OpenFOAM-v9 on Linux-based HPC Server","text":"A warm welcome to my blog!I hope this post can be helpful to your research. A brief introductionIn this post, we will walk through the procedures of compiling/installing OpenFOAM-v9 on your Linux-based High Performance Computing (HPC) server. Here, I use my case as an example to showcase the general method. Please note that you still need to modify a bit based on your server environment. 1) Downloading the source code12345$ cd ~ //go to your home directory$ mkdir OpenFOAM $ cd OpenFOAM$ git clone https://github.com/OpenFOAM/OpenFOAM-9.git$ git clone https://github.com/OpenFOAM/ThirdParty-9.git 2) Loading the compiling environmentThis step depends on your server. However, the most important dependencies for OpenFOAM are: gcc, mpi, boost, and sometimes cmake.Here is a list of module I will load for my case: 123$ module load gcc/8.2.0$ module load boost/gcc/1.68.0$ module load openmpi/gcc/4.0.2 If you happen to have a scotch module pre-compiled on your server, please do load it and you don’t need to compile it in the next step. BUt you need to add the module load command for scotch into your alias in Step 5. 3) Compiling third-party utilitiesThis step is probably the most essential to the success.We firstly need to download some key packages to the ThirdParty-9/ directory: 123456789$ cd ~/OpenFOAM/ThirdParty-9$ wget https://cmake.org/files/v3.9/cmake-3.9.0-Linux-x86_64.tar.gz$ tar xvzf cmake-3.9.0-rc2-Linux-x86_64.tar.gz cmake-3.9.0$ wget http://134.100.28.207/files/src/cgal/CGAL-5.0.2.tar.gz$ tar xvzf CGAL-5.0.2.tar.gz CGAL-5.0.2$ wget https://src.fedoraproject.org/lookaside/pkgs/metis/metis-5.1.0.tar.gz/$ tar xvzf metis-5.1.0.tar.gz metis-5.1.0$ wget https://src.fedoraproject.org/lookaside/extras/scotch/scotch_6.0.9.tar.gz/$ tar xvzf scotch_6.0.9.tar.gz scotch_6.0.9 Now, we have all the necessary packages in the ThirdParty-9/ directory, we can just compile them: 1$ ./Allwmake 4) Compiling OpenFOAMThis step is pretty straightforward. Just to make sure you are in the OpenFOAM-9/ directory: 1$ cd ~/OpenFOAM/OpenFOAM-9 and then type in: 1$ ./Allwmake -j $Number of Cores and change $Number of Cores to a number that your head machine allows. For my case, I normally use 8 cores on my head machine, which takes around 20 minutes to compile the whole OpenFOAM library. 5) Setting up an aliasAfter compiling OpenFOAM, you might want to set up an alias so that you don’t need to manually load the modules and source the bashrc file.For example, you can choose to use echo: 1$ echo &quot;alias of9='module load gcc/8.2.0&amp;&amp;module load boost/gcc/1.68.0&amp;&amp;module load openmpi/gcc/4.0.2&amp;&amp;source $HOME/OpenFOAM/OpenFOAM-9/etc/bashrc WM_LABEL_SIZE=64'&quot; &gt;&gt;$HOME/.bashrc or, you can go to your $HOME directory and modify the .bashrc file manually using vim, nano, emacs or whatever text editor you prefer. Note: You will mostly likely to have different versions of gcc and mpi on your server, and so you need to change a bit from my command line. If you are using openmpi instead of intel-mpi, be sure to load gcc before loading your mpi, otherwise you will very likely to have errors related to sharing libraries. Remember, after updating the .bashrc file, you will need to refresh the bash environment by typing:1$ bash 6) Some common issuesTo be continued…","link":"/2021/12/19/openfoam-v9-installation-server/"}],"tags":[{"name":"OpenFOAM-v9","slug":"OpenFOAM-v9","link":"/tags/OpenFOAM-v9/"},{"name":"Linux","slug":"Linux","link":"/tags/Linux/"}],"categories":[{"name":"OpenFOAM-101","slug":"OpenFOAM-101","link":"/categories/OpenFOAM-101/"}]}