{"pages":[{"title":"","text":"google-site-verification: googlef9d64c6e70a17f28.html","link":"/googlef9d64c6e70a17f28.html"},{"title":"About","text":"About this siteThis site is my personal blog.I will write something on OpenFOAM, Paraview, Linux, Photography, and some crazy random stuffs. Obviously, this blog is not for experts to waste their lunch break. I guess it is only for those who are interested in CFD and OpenFOAM, but found most of the tutorials and guides online too complex. When I first started everything in CFD and OpenFOAM, I found most guides and tutorials were for those who already knew a lot in this area. It is very challenging for self-taught students like me to fully understand even some basic concepts. Even so, if you are a Chinese student who learned your Maths and Physics in Chinese languge, you will probably find yourself like a baby in kindergarten when facing CFD and OpenFOAM. There is just too much knowledge you need to learn it again in English. So I guess one of the potential audiences of this blog is this group. Why would I begin building this blog? I guess you just have to build something once you accidentally bought a domain name. Also, I found writing (excluding thesis writing) a very pleasing activity for me. Since English is not my first language, you might have found lots of grammar mistakes and a funny vocabulary. I also have plans to write in Chinese. Hopefully I will make this site a bilingual one. Currently, this site is still under construction, and so you will find a lot of messy widgets and uncomfortable fonts. I will fix them eventually but probably in an extremely slow pace. About meMy name is Yuxiang Zhang. I am currently a PhD student at University College Dublin. My research interests lie in the area of CFD (Computational fluid dynamics/Colorful Figures Delivery) and bridge engineering. I am currently wiring my thesis, of which the title is still a mystery. If everything converges like a simple steady-state simulation, I will be expecting my PhD degree in May 2022. Fingers-crossed! Education2018 - PresentPhD in Civil EngineeringThesis working title: Application of Computational Fluid Dynamics in Bridge EngineeringFunding: China Scholarship CouncilUniversity College Dublin In CFD simulations, my research has investigated the application of CFD modelling for the analysis of wind on the Rose Fitzgerald Kennedy Bridge. The outcome of my research will help validate the use of CFD for the analysis of wind for bridge design. Research included: • Securing access to the Key cluster computer operated by ICHEC (Irish Centre for High-End Computing) • Project management and self-directed learning • Collaboration with stakeholders: Arup CFD team, TII, NSAI • Publication of Journal Papers • Presentations at international conferences 2017 - 2018Masters of Engineering Science in Structural EngineeringGrade: 2:1University College DublinResearch thesis: CFD simulations examining sheltering traffic from wind. 2013 - 2017Bachelor of Engineering in Civil Engineering1st Class honoursChang’an University, China Work experience2018 - PresentTeaching assistant (part-time)I help lecturers to correct students’ assignments and answers questions during tutorial sessions.Modules I taught: Structural analysis Structural dynamics Geotech Water resources P.S. Would you be suprised if I told you I used to work in a butcher’s store in Dublin? PublicationA literature reviewZhang, Y., Cardiff, P., and Keenahan, J., (2021). ‘Wind-induced phenomena in long-span cable-supported bridges: a comparative review of wind tunnel tests and computational fluid dynamics modelling’, Applied Sciences, 11(4), 1642. link of the paper Honestly, I still cannot understand why I would even try to write such a paper. But anyway, with the help of my advisors, I managed to publish this as the first journal paper during my PhD. Well, you got to start somewhere. If you really spend time reading this paper, you probably will not learn much but some basics about wind problems on bridges and CFD application in bridge engineering. After so long, I think the content can be summarised into three sentences: CFD is cool but complex; Wind tunnel is the common practice but obviously not perfect for bridge aerodyanmic study; There is SO MUCH ROOM for improvement in using CFD in bridge engineering. A comparison between CFD and wind tunnel tests (WTTs)Zhang, Y., Cardiff, P., Cahill, F., and Keenahan, J., (2021). ‘Assessing the capability of computational fluid dynamics models in replicating wind tunnel test results for the Rose Fitzgerald Kennedy Bridge’, CivilEng 2, no. 4: 1065-1090. link of the paper. So after I finished the literature review (well this might not be true, I probably planned everything long ago), I was thinking maybe I should compare CFD and WTTs since I have written so much against WTTs in bridge engineering. And BINGO! My supervisor got me a WTT report from a famous construction company that I don’t think I should mention here though you will probably find out which one it is if you read the paper (OMG, such a long sentence for me). Anyway, I replicated the WTTs mentioned in the report and did a comparison on the results. It turned out to be okay but not quite satisfying because some non-negligible discrepancies were found within the comparison between WTTs and CFD and we cannot say which one got the better results. A methodology paperZhang, Y., MacReamoinn, R., Cardiff, P., and Keenahan, J., (2021). ‘A workflow for analysing wind effects on long-span bridges using open-source software’, under review with the OpenFOAM Journal. This paper talks about the methodology that can be adopted by bridge engineers when performing CFD simulations. It is still under review. I am not optimistic about it. I don’t think anyone will like it. I can only imagine that the reviewers be like: Emmm, this is probably new but boring. A comparison between CFD and field measurementZhang, Y., Cardiff, P., Sweeney, C., and Keenahan, J., (2021). ‘Comparison of field data from the Rose Fitzgerald Bridge with full-scale CFD models’, under review with the Journal of Bridge Engineering. Did I spend months standing on a bridge? Nope. I amd privileged to be granted the access to some fancy real-time data recorded by four anemometers on the bridge. Why would I need to do this? Because I still want to be the bad guy to tell everyone else that CFD is better than your over-priced WTTs. I need a third-party to help me prove that. And this third-party will be this non-biased field measurement data. A conference paperZhang, Y., Cardiff, P., and Keenahan, J., (2020). ‘A numerical study of the effect of wind barriers on traffic and the bridge deck’, in Proceedings of the Civil Engineering Research in Ireland Conference, Cork, Ireland, 27-28 August 2020. link of the paper Yes, I know. It is funny to mention a conference paper. But the content of this paper is basically what I did in my Masters.My advice: Don’t do a masters but find a PhD position or a decent job. Scholarships and AwardsChina Scholarship Council (CSC) Individual Fellowship Award (2018)This scholarship sponsors Chinese citizens to pursue study abroad and for international students to study in China. Awardees are selected through a rigorous academic evaluation process organised by the Chinese Scholarship Council. This individual fellowship, awarded to me, funds my PhD studies at UCD. Nvidia GPU Grant (2019)This grant provided by NVidia offers a GTX Titan V GPU to support my PhD studies. The GPU is used for post-processing, rendering and computational modelling. HobbiesPhotographyViolin Thank you for visiting this site. I wish you a fast convergence!","link":"/about/index.html"}],"posts":[{"title":"Marpit:an Alternative to PowerPoint","text":"This post introduces a new way to make presentation keynote, using a package named Marpit, which is based on the Markdown syntax.","link":"/2022/01/05/marpi/"},{"title":"How to Compile OpenFOAM-v9 on Linux-based HPC Server","text":"A warm welcome to my blog!I hope this post can be helpful to your research. A brief introductionIn this post, we will walk through the procedures of compiling/installing OpenFOAM-v9 on your Linux-based High Performance Computing (HPC) server. Here, I use my case as an example to showcase the general method. Please note that you still need to modify a bit based on your server environment. 1) Downloading the source code12345$ cd ~ //go to your home directory$ mkdir OpenFOAM$ cd OpenFOAM$ git clone https://github.com/OpenFOAM/OpenFOAM-9.git$ git clone https://github.com/OpenFOAM/ThirdParty-9.git 2) Loading the compiling environmentThis step depends on your server. However, the most important dependencies for OpenFOAM are: gcc, mpi, boost, and sometimes cmake.Here is a list of module I will load for my case: 123$ module load gcc/8.2.0$ module load boost/gcc/1.68.0$ module load openmpi/gcc/4.0.2 If you happen to have a scotch module pre-compiled on your server, please do load it and you don’t need to compile it in the next step. But you need to add the module load command for scotch into your alias in Step 5. 3) Compiling third-party utilitiesThis step is probably the most essential to the success.We firstly need to download some key packages to the ThirdParty-9/ directory: 123456789$ cd ~/OpenFOAM/ThirdParty-9$ wget https://cmake.org/files/v3.9/cmake-3.9.0-Linux-x86_64.tar.gz$ tar xvzf cmake-3.9.0-rc2-Linux-x86_64.tar.gz cmake-3.9.0$ wget http://134.100.28.207/files/src/cgal/CGAL-5.0.2.tar.gz$ tar xvzf CGAL-5.0.2.tar.gz CGAL-5.0.2$ wget https://src.fedoraproject.org/lookaside/pkgs/metis/metis-5.1.0.tar.gz/$ tar xvzf metis-5.1.0.tar.gz metis-5.1.0$ wget https://src.fedoraproject.org/lookaside/extras/scotch/scotch_6.0.9.tar.gz/$ tar xvzf scotch_6.0.9.tar.gz scotch_6.0.9 Now, we have all the necessary packages in the ThirdParty-9/ directory, we can just compile them: 1$ ./Allwmake 4) Compiling OpenFOAMThis step is pretty straightforward. Just to make sure you are in the OpenFOAM-9/ directory: 1$ cd ~/OpenFOAM/OpenFOAM-9 and then type in: 1$ ./Allwmake -j $Number of Cores and change $Number of Cores to a number that your head machine allows. For my case, I normally use 8 cores on my head machine, which takes around 20 minutes to compile the whole OpenFOAM library. 5) Setting up an aliasAfter compiling OpenFOAM, you might want to set up an alias so that you don’t need to manually load the modules and source the bashrc file.For example, you can choose to use echo: 1$ echo &quot;alias of9='module load gcc/8.2.0&amp;&amp;module load boost/gcc/1.68.0&amp;&amp;module load openmpi/gcc/4.0.2&amp;&amp;source $HOME/OpenFOAM/OpenFOAM-9/etc/bashrc WM_LABEL_SIZE=64'&quot; &gt;&gt;$HOME/.bashrc or, you can go to your $HOME directory and modify the .bashrc file manually using vim, nano, emacs or whatever text editor you prefer. Note: You will mostly likely to have different versions of gcc and mpi on your server, and so you need to change a bit from my command line. If you are using openmpi instead of intel-mpi, be sure to load gcc before loading your mpi, otherwise you will very likely to have errors related to sharing libraries. Remember, after updating the .bashrc file, you will need to refresh the bash environment by typing:1$ bash","link":"/2021/12/19/openfoam-v9-installation-server/"},{"title":"How to use ParaView on HPC Server","text":"A warm welcome to my blog!I hope this post can be helpful to your research. A brief introduction In this post, I will show you the easiest way to visualise your simulation results in ParaView on your Linux-based High Performance Computing (HPC) server. Here, I use my case as an example to showcase the general method. Please note that you still need to modify a bit based on your server environment. 1. Downloading the pre-compiled packagesPre-compiled packages of ParaView are availabe at this link.ParaView is really famous for this type of portable package form, which is really handy for a world that has so many different operating systems. However, if you are really new to ParaView, you will easily be overwhelmed by its various versions. There are even different boudles for the same version number. There are two reasons why they have to keep it in this way. Firstly, there are different machine types when running ParaView. You might just use it to do daily rendering and visualising on your laptop using the GUI, or you might not need to have a GUI when you are a pro in Python. So there are packages for the so-called headless machine and the packages for the full boundle. The difference is really just the former does not have the GUI while the latter has. So I really recommend you use the complete boundle with the GUI. You can always practice using the Python codes with a package with GUI. Secondly, because there are two branches of Python, the Python 2, often called Python; and the Python 3, which does not gurantee a downward compatibility. Since the server I can access has really funny Python 3 environment. I suggest all of you check the version of the default Python on your server by typing this first: 1$ Python --version If it returns something like this a version 2.X.X, then choose a ParaView version that works with Python 2. If you are really sure your server has Python 3 as its default, you can choose the version that goes with Python 3. Also, if there are some pre-compiled Python 3 modules on your server, load the latest before using Paraview for Python 3. Here, I am currenty using ParaView-5.8.1-MPI-Linux-Python2.7-64bit, so I typed: 1$ wget &quot;https://www.paraview.org/paraview-downloads/download.php?submit=Download&amp;version=v5.8&amp;type=binary&amp;os=Linux&amp;downloadFile=ParaView-5.8.1-MPI-Linux-Python2.7-64bit.tar.gz&quot; Then extract the compressed package by: 1$ tar xvzf ParaView-5.8.1-MPI-Linux-Python2.7-64bit.tar.gz I just like to add v when I do tar action, because it looks cool. You don’t need to add v in your command. Again, if you are really interested in compiling the software yourself on a hpc server environment, you either need to have the super power of sudo, or you need some extreme patience on setting up all the environment and manually compiling all the dependencies. I would never even give it a try.But I know, there are always the compiling nerds who need to have the source codes and here is the link of ParaView on github. 2. Setting up Xorgs ServerBy far, you have completed all the settings on the server side. Now, we need to prepare the X windows system (X11). Let’s talk about the settings for the three mainstream operating systems. 1) LinuxAll branches of Linux-based systems use X.Org Server, which is most likely pre-compiled within your system. However, for some reasons, you happened to have messed up your system and deleted the default Xorgs service. No problem, here is how you can get it back. For Ubuntu: 1$ sudo apt install x11-apps For Red had: 12$ sudo yum install xorg-x11-xauth$ sudo yum install xterm For SUSE: 12$ sudo zypper install xorg-x11-xauth$ sudo zypper install xterm Once you got the X.org service installed, you can try connect with your server using ssh -X. Note that the it is a capital X. And if your connection to the server with X11 forwarding succeeds, you should see no error in the login message. 2) MacOSMacOS uses XQuartz: Make sure you have installed the Xcode’s command line tool. If you haven’t, check out this link. Then you just copy and paste this in your Mac terminal: 1$ /bin/bash -c &quot;$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)&quot; And yes, now you have it. Just remember to start the Xquartz app before doing ssh -X. 3) WindowsWindows uses XMing: Firstly, install the XMing package using this link Then, like in MacOS, you need to start your XMing before you connect to your server. However, many of you, if using Windows, are probably using PuTTy or other SSH clients maybe because you need to use a bastion station to connect to the server, you just need to make sure you enabled the X11 forwarding in the settings of the app before any connections.For instance, you need to check the “Enable X11 forwarding” and type in the default X11 screen location (normally localhost:0, if not try localhost:1, 2, 3, … until you find it) in PuTTy: 3. Excuting the binariesNow, we establish a connection with X11 forwarding: 1$ ssh -X userName@domainName.com Then, we cd into the ParaView-5.8.1-MPI-Linux-Python2.7-64bit/bin directory. In the end, we simply excute the binary of ParaView: 1$ ./paraview-mesa paraview where you can think of paraview-mesa as a driver that forces the CPU to do the work of GPU.","link":"/2022/01/06/paraview-on-server/"}],"tags":[{"name":"PPT，Markdown，Marpit","slug":"PPT，Markdown，Marpit","link":"/tags/PPT%EF%BC%8CMarkdown%EF%BC%8CMarpit/"},{"name":"OpenFOAM-v9","slug":"OpenFOAM-v9","link":"/tags/OpenFOAM-v9/"},{"name":"Linux","slug":"Linux","link":"/tags/Linux/"},{"name":"HPC","slug":"HPC","link":"/tags/HPC/"},{"name":"Paraview","slug":"Paraview","link":"/tags/Paraview/"}],"categories":[{"name":"Markdown","slug":"Markdown","link":"/categories/Markdown/"},{"name":"OpenFOAM-101","slug":"OpenFOAM-101","link":"/categories/OpenFOAM-101/"},{"name":"ParaView-101","slug":"ParaView-101","link":"/categories/ParaView-101/"}]}